In [1]:
import sys
sys.path.append("../src")

In [2]:
from preprocess import load_customer_data, clean_customer_data

In [3]:
df_raw = load_customer_data("../data/customer_profiles.csv")
df_raw.head()

✅ Loaded data with shape: (5, 5)

  Customer_ID   Age  Gender     Location  Total_Spend
0        C001  34.0    Male     New York      1200.50
1        C002  28.0  Female          NaN       830.00
2        C003   NaN  Female  Los Angeles       950.75
3        C004  45.0    Male      Chicago          NaN
4        C005  31.0     NaN      Seattle       720.10

In [4]:
df_clean = clean_customer_data(df_raw)
df_clean

✅ Cleaned data with shape: (5, 5)

  customer_id   age   gender     location  total_spend
0        C001  34.0     Male     New York     1200.500
1        C002  28.0   Female      Unknown      830.000
2        C003  32.5   Female  Los Angeles      950.750
3        C004  45.0     Male      Chicago      890.375
4        C005  31.0  Unknown      Seattle      720.100